<!DOCTYPE html>
<html>
  <head>
    <title>Pascal</title>
    <meta name="viewport" content="width=device-width,initial-scale=1">
    <meta charset="utf-8">
    <meta name="csrf-param" content="authenticity_token">
<meta name="csrf-token" content="VnwCbtojN0izLVCyEnTknmr6Boc6e2iDzt0oNxlxLPuDpOnufWgBoeIMvD_8uDpkTNtOWmx7LkHKVbpivaWKLQ">
    

    <link rel="stylesheet" href="assets/app_css-a39377eb3f3fa69c18ed7fbe0605312464b39bb94a20a47b99309a7713157ee7.css">
    <script src="assets/application-dc6b2123822d4d75d545c58e8cd82bdb9ab69dcf065d5fdccd3f20f1d53e6630.js" defer></script>
  </head>

  <body>
    <nav class="navbar navbar-expand-lg navbar-light bg-light">
      <div class="container-fluid">
        <a class="navbar-brand" href="">Pascal Rainville</a>
        <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarText" aria-controls="navbarText" aria-expanded="false" aria-label="Toggle navigation">
          <span class="navbar-toggler-icon"></span>
        </button>
        <div class="collapse navbar-collapse" id="navbarText">
          <div class="navbar-nav ms-auto mb-2 mb-lg-0">
            <a class="nav-item nav-link" href="prog">Programmation</a>
            <a class="nav-item nav-link" href="robot">Robotique</a>
            <a class="nav-item nav-link" href="conception">Conception</a>
            <a class="nav-item nav-link active" href="projects">Projets</a>
          </div>
        </div>
      </div>
    </nav>
    <div class="responsive-margins-lg">

  <div class="section d-md-flex gap-30">
  <img width="640" style="border: 10px solid #555" src="trempette.jpg">
  <div>
    <h2>Projet: Site de recettes</h2>
    <p>Un site web qui receuille des recettes d'utilisateurs.</p>
    <p>Les avantages de ce site compar&#xE9; &#xE0; d'autres sont:</p>
    <ul>
      <li>Ingr&#xE9;dients directement dans les instructions pour suivre la recette plus facilement.</li>
      <li>Belles images de photographes pour donner envie.</li>
      <li>Conversion d'unit&#xE9;s dans le format local.</li>
    </ul>
  </div>
</div>

  <div class="section d-md-flex gap-30">
  <img width="600" style="border: 1px solid black;" src="screenshot_sim.jpg">
  <div>
    <h2>Projet: Simulation d'un bras robotique robot</h2>
    <p>Pour programmer un bras robotique, il est primordial d'avoir acc&#xE8;s &#xE0; un logiciel pour simuler comment le robot va se conporter dans le monde r&#xE9;el.</p>
    <p>J'ai cr&#xE9;er un simulateur pour mon bras robotique dans le logiciel Godot. Ce logiciel est principalement utilis&#xE9; pour concevoir des jeux vid&#xE9;os, mais j'ai trouv&#xE9; qu'il &#xE9;tait tr&#xE8;s ad&#xE9;quat pour faire un simulateur!</p>
  </div>
</div>

  <div class="section d-md-flex gap-30">
  <img width="500" style="border: 10px solid #555;" src="screenshot_app.jpg">
  <div>
    <h2>Projet: Application recettes personalis&#xE9;es</h2>
    <p>L'objectif de cette application est de r&#xE9;soudre le probl&#xE8;me de ne pas savoir quoi cuisiner. Les recettes sont &#xE9;tiquett&#xE9;es de mani&#xE8;re &#xE0; trouver la r&#xE9;ponse &#xE0; cette question pour toutes les occasions.</p>
    <p>Personnellement, je classe mes recettes selons ces cat&#xE9;gories:</p>
    <ul>
      <li>Recette rapide (pour un soir de semaine quand je n'ai pas beaucoup le temps de cuisiner)</li>
      <li>Pour la semaine (pour cuisiner des grandes quantit&#xE9;s le dimanche pour la semaine)</li>
      <li>Romantique (pour des recettes un peu plus fancy et pas trop salissante!)</li>
      <li>Potluck (pour des recettes qui se partagent bien et qui peuvent se manger sans ustensiles)</li>
      <li>BBQ (pour mes recettes v&#xE9;g&#xE9;s sur le BBQ pour accompagner ma copine carnivore)</li>
      <li>Picnic (pour avoir des id&#xE9;es de quoi emporter en picnic)</li>
      <li>Et bien d'autres...</li>
    </ul>
  </div>
</div>

  <div class="section d-md-flex gap-30">
  <video width="600" height="312" controls="controls" autobuffer="true" muted="muted" src="/robot_pour.mp4"></video>
  <div>
    <h2>Projet: Bras robotique</h2>
    <p>J'ai con&#xE7;u de toutes pi&#xE8;ces un bras robotique dans le but d'aider &#xE0; la cuisine.</p>
    <p>C'est un robot 5 axes avec une pince comme effecteur au bout pour tenir des objets ou des outils.</p>
  </div>
</div>

  <div class="section d-md-flex gap-30">
  <img height="800" style="border: 1px solid #555;" src="closed_cupboard.jpg">
  <div>
    <h2>Projet: Armoire de cuisine</h2>
    <p>Une armoire spacieuse en contreplaqu&#xE9; d'&#xE9;rable. Rangement sur les portes de l'armoires pour un acc&#xE8;s rapide. Tablettes dans le fond seulement pour bien voir ce qu'il y a en inventaire.</p>
    <a class="know-more" href="armoire">En savoir plus...</a>
  </div>
</div>

  <div class="section d-md-flex gap-30">
  <img width="400" style="border: 1px solid #555;" src="jar_label.jpg">
  <div>
    <h2>Projet: &#xC9;tiquettes intelligentes</h2>
    <p>J'ai cr&#xE9;er une sorte d'&#xE9;tiquette sp&#xE9;cialement con&#xE7;u pour &#xEA;tre lisible par une intelligence artificielle et par un humain (contrairement aux codes QR).</p>
    <p>L'&#xE9;tiquette est d&#xE9;limit&#xE9;e d'un cercle, et contient deux points de r&#xE9;f&#xE9;rence. Cela permet de d&#xE9;terminer l'orientation. Ainsi, le logiciel de lecture tourne l'image pour que le texte soit dans le bon sens. Ensuite, le logiciel utilise une librairie de reconnaissance optique de caract&#xE8;res afin de lire le texte.</p>
    <p><b>&#xC9;tat actuel:</b> J'ai cr&#xE9;er un mini logiciel pour cr&#xE9;er des &#xE9;tiquettes dynamiquement qui fonctionne bien. Pour la lecture, il reste encore beaucoup de travail &#xE0; faire. Le logiciel de lecture est capricieux pour l'&#xE9;clairage. Il d&#xE9;tecte correctement &#xE0; peu pr&#xE8;s 70% du temps.</p>
  </div>
</div>

  <div class="section d-md-flex gap-30">
  <img width="500" style="border: 1px solid #555;" src="chuck_laser_03.jpg">
  <div>
    <h2>Projet: Guide laser pour perceuse &#xE0; colonne</h2>
    <p>Un guide laser imprim&#xE9; en 3d qui s'installe sur une perceuse en colonne.</p>
    <p>Lorsque la perceuse tourne, le pointeur laser tourne aussi. &#xC0; vitesse suffisament &#xE9;lev&#xE9;, le point lumineux devient une cercle. Cela permet d'aligner rapidement pour percer un trou.</p>
    <p>C'est un prototype pas trop fonctionnel.</p>
    <a class="know-more" href="laser">En savoir plus...</a>
  </div>
</div>

  <div class="section d-md-flex gap-30">
  <img width="500" style="border: 1px solid #bbb;" src="divan.jpg">
  <div>
    <h2>Projet: Restaurer le divan</h2>
    <p>Le tissu en faux cuir &#xE9;tait en train de s'&#xE9;miett&#xE9;. J'ai tout enlev&#xE9; le tissu des coussins et j'ai recousu des nouveaux avec du tissu neuf.</p>
    <p>Il y avait 3 coussins de dossiers, 2 petit coussins pour s'asseoir et 1 grand coussin pour s'asseoir. J'ai tout d&#xE9;cousu les tissus de chacune des sortes. J'ai ensuite d&#xE9;coup&#xE9; des morceaux dans le tissus neuf de la m&#xEA;me taille que le gabarit. J'ai ensuite cousu les housses. C'est quand m&#xEA;me long, mais &#xE7;a se fait super bien!</p>
    <p>Il reste maintenant le tissu de la partie rigide a chang&#xE9;, mais je n'ai pas encore trouv&#xE9; de tissu que me convenait pour cela.</p>
  </div>
</div>

  <div class="section d-md-flex gap-30">
  <img width="400" style="border: 1px solid #555;" src="mattress_pump_02.jpg">
  <div>
    <h2>Projet: Pompe pour matelas gonflable</h2>
    <p>Un matelas gonflable qui se d&#xE9;gonfle pendant la nuit c'est un classique et c'est tellement d&#xE9;sagr&#xE9;able. J'ai essay&#xE9; de le patch&#xE9;, mais je n'ai pas r&#xE9;ussit. Je ne voulait pas non plus achet&#xE9; un autre matelas et mettre le mien &#xE0; la poubelle.</p>
    <p>Alors, j'ai achet&#xE9; une petite pompe d'aquarium pour qu'elle pompe de l'air toute la nuit quand le matelas se d&#xE9;gonffle. La pompe n'est pas tr&#xE8;s bruyante et suffit largement pour gonfler, m&#xEA;me trop. J'ai donc con&#xE7;u un interrupteur de pression pour arr&#xEA;ter la pompe de fonctionner lorsque la pression est trop &#xE9;lev&#xE9;.</p>
    <a class="know-more" href="pump">En savoir plus...</a>
  </div>
</div>

  <div class="section d-md-flex gap-30">
  <img width="500" style="border: 1px solid #555;" src="admin_website.jpg">
  <div>
    <h2>Projet: Site web d'administration</h2>
    <p>J'ai appris beaucoup de chose en administration lorsque j'ai suivi le cours &#xAB;Lancement d'une entreprise&#xBB;. Pour les mettre en pratique, je me suis fait un petit site internet pour g&#xE9;rer l'administration de mon projet.</p>
    <p>Les pages sont:</p>
    <ul>
      <li>Factures: Toutes les factures pour les items achet&#xE9;s</li>
      <li>Pi&#xE8;ces: La liste de tous les biens qui sont ou ont d&#xE9;j&#xE0; &#xE9;t&#xE9; utilis&#xE9;</li>
      <li>Fournisseurs: La liste de tous les fournisseurs</li>
      <li>Commandes: Une liste temporaire des biens ou services &#xE0; acheter</li>
      <li>Rapprochement bancaire, Bilan, &#xC9;tats financiers: (Pas encore impl&#xE9;ment&#xE9;)</li>
    </ul>
  </div>
</div>


  </div>

  </body>
</html>
